In [1]:
import pandas as pd

df = pd.read_csv("customer_sales_dataset.csv")
df.head()

,Customer_ID,Name,Date_of_Birth,Purchase_Date,Purchase_Amount,City,Gender
0,1654,Customer_1,1979-02-28,2023-01-26,3733.60,Mumbai,Female
1,1142,Customer_2,2007-03-15,2023-04-15,3415.83,Bangalore,Male
2,1604,Customer_3,1993-02-02,2023-02-02,246.01,Mumbai,Female
3,1517,Customer_4,2001-03-03,2023-01-28,2850.10,Pune,FEMALE
4,1225,Customer_5,1994-04-25,2024-08-26,1463.13,Kolkata,Male

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1010 entries, 0 to 1009
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Customer_ID      1010 non-null   int64
 1   Name             1010 non-null   object
 2   Date_of_Birth    1010 non-null   object
 3   Purchase_Date    1010 non-null   object
 4   Purchase_Amount  999 non-null    float64
 5   City             999 non-null    object
 6   Gender           1010 non-null   object
dtypes: float64(1), int64(1), object(5)
memory usage: 55.4+ KB

In [3]:
data_dictionary = pd.DataFrame({
    "Column_Name": df.columns,
    "Data_Type": df.dtypes.values,
    "Description": [
        "Unique customer ID",
        "Customer Name",
        "Customer Date of Birth",
        "Purchase Date",
        "Purchase Amount",
        "Customer City",
        "Customer Gender"
    ]
})

data_dictionary

       Column_Name Data_Type             Description
0      Customer_ID     int64      Unique customer ID
1             Name    object           Customer Name
2    Date_of_Birth    object  Customer Date of Birth
3    Purchase_Date    object           Purchase Date
4  Purchase_Amount   float64         Purchase Amount
5             City    object           Customer City
6           Gender    object         Customer Gender

In [4]:
df.isnull().sum()

Customer_ID         0
Name                0
Date_of_Birth       0
Purchase_Date       0
Purchase_Amount    11
City               11
Gender              0
dtype: int64

In [5]:
df.duplicated().sum()

10

In [6]:
df["Gender"].unique()

array(['Female', 'Male', 'FEMALE', 'male'], dtype=object)

In [7]:
df.describe()

       Customer_ID  Purchase_Amount
count  1010.000000       999.000000
mean   1501.609901      2528.076196
std     288.488207      1392.395892
min    1001.000000       110.770000
25%    1261.250000      1366.800000
50%    1497.500000      2531.020000
75%    1750.000000      3711.870000
max    2000.000000      4996.930000

In [8]:
df = df.drop_duplicates()

In [9]:
df.duplicated().sum()

0

In [12]:
df["City"] = df["City"].fillna("Unknown")

df["Purchase_Amount"] = df["Purchase_Amount"].fillna(
    df["Purchase_Amount"].mean()
)

In [13]:
df.isnull().sum()

Customer_ID        0
Name               0
Date_of_Birth      0
Purchase_Date      0
Purchase_Amount    0
City               0
Gender             0
dtype: int64

In [14]:
df["Gender"] = df["Gender"].str.capitalize()

In [15]:
df["Gender"].unique()

array(['Female', 'Male'], dtype=object)

In [16]:
df["Date_of_Birth"] = pd.to_datetime(df["Date_of_Birth"])
df["Purchase_Date"] = pd.to_datetime(df["Purchase_Date"])

In [17]:
df.dtypes

Customer_ID                 int64
Name                       object
Date_of_Birth      datetime64[ns]
Purchase_Date      datetime64[ns]
Purchase_Amount           float64
City                       object
Gender                     object
dtype: object

In [18]:
from datetime import datetime

current_year = datetime.now().year
df["Customer_Age"] = current_year - df["Date_of_Birth"].dt.year

In [19]:
df.head()

,Customer_ID,Name,Date_of_Birth,Purchase_Date,Purchase_Amount,City,Gender,Customer_Age
0,1654,Customer_1,1979-02-28,2023-01-26,3733.60,Mumbai,Female,47
1,1142,Customer_2,2007-03-15,2023-04-15,3415.83,Bangalore,Male,19
2,1604,Customer_3,1993-02-02,2023-02-02,246.01,Mumbai,Female,33
3,1517,Customer_4,2001-03-03,2023-01-28,2850.10,Pune,Female,25
4,1225,Customer_5,1994-04-25,2024-08-26,1463.13,Kolkata,Male,32

In [20]:
Q1 = df["Purchase_Amount"].quantile(0.25)
Q3 = df["Purchase_Amount"].quantile(0.75)
IQR = Q3 - Q1

df = df[(df["Purchase_Amount"] >= Q1 - 1.5*IQR) &
        (df["Purchase_Amount"] <= Q3 + 1.5*IQR)]

In [21]:
print("Rows after removing outliers:", df.shape[0])

Rows after removing outliers: 1000

In [22]:
df.to_csv("cleaned_customer_sales.csv", index=False)